{"funded_research":"<p>1.  National Institute of General Medical Sciences Medical Scientist Training Program, role: <strong>Training Grant Recipient</strong>, 8/93-8/94.</p>\n\n<p>2.  5 F30 MH10819 Predoctoral National Research Service Award, “Neuropsychological Indicators of Risk for Schizophrenia,” role: <strong>Principal Investigator</strong>, 9/94-5/00.</p>\n\n<p>3.  NARSAD (Young Investigator Award), “Hypothalamic-Pituitary-Adrenal Function in Adults with a History of Childhood Parental Loss,” role: <strong>Principal Investigator</strong>; 6/03-5/05, &#36;60,000.</p>\n\n<p>4.  Janssen Pharmaceutica Faculty Development Award in Psychopharmacology, role: <strong>Principal Investigator</strong>, 5/18/03, &#36;25,000.</p>\n\n<p>5.  RSGPB PBP-103382 American Cancer Society, “Improving Smoking Cessation in Smokers with<br />\nDepressive Symptoms”, role: <strong>Study Physician</strong>, 7/02-6/04</p>\n\n<p>6.  Medtronic, Inc., “Electrical Stimulation of the Anterior Limb of the Internal Capsule to Treat Major Depressive Disorder,” role: <strong>Co-Investigator</strong>, 10/02-9/04, &#36;315,000.</p>\n\n<p>7.  K23MH067947 Mentored Patient-Oriented Research Career Development Award, “Risk for Depression, Stress, and Neuroendocrine Function,” role: <strong>Principal Investigator</strong>; 12/03-11/08,  &#36;905,000.</p>\n\n<p>8.  Pfizer, Inc. “Sertraline Treatment and Cortisol Response to the DEX/CRH Test”, Investigator-Initiated, role: <strong>Co-Investigator</strong>, 1/04-11/06, &#36;300,684.</p>\n\n<p>9.  United States Department of the Interior, “Perceived Early Life Stress and DEX/CRH Test Response as Predictors of Psychological Sequelae following Exposure of Healthy Adults to War Stress,” role: <strong>Co-Investigator</strong>, 7/04-6/05, &#36;40,000</p>\n\n<p>10. UCB Pharma, Inc. “Keppra Treatment and Cortisol Response to the DEX/CRH Test in Healthy Subjects,” Investigator-Initiated, role: <strong>Co-Investigator</strong>, 6/04-5/07, &#36;111,624.</p>\n\n<p>11. NCCAM/NIMH AT001742, \"Double-blind, placebo-controlled study of SAMe vs. escitalopram in MDD,\" role: <strong>Study Physician</strong>, 4/04 - 3/09,  &#36;1,087,938.</p>\n\n<p>12. United States Department of Defense, “Biomarkers of risk for post-traumatic stress disorder (PTSD),” role: <strong>Principal Investigator</strong>, 4/01/07-4/01/10, &#36;409,390.</p>\n\n<p>13. Cyberonics, Inc. “Randomized Comparison of Outcomes in Patients with Treatment-Resistant Depression Who Receive VNS Therapy Administered at Different Amounts of Electrical Charge”  role: <strong>Co-Investigator</strong>; 11/1/07-12/1/10; &#36;230,000.                                                                                                       </p>\n\n<p>14. Medtronic, Inc.  “RECLAIM Deep Brain Stimulation (DBS) Clinical Study for Treatment- Resistant Depression.” Multi-Site;  role: <strong>Sub-Investigator</strong> 4/16/2009-5/1/2012, &#36;329,280.</p>\n\n<p>15. R01 MH0687670 “DEX/CRH Response: Mood/Anxiety Disorder Endophenotype? Phase 2.” role: <strong>Co-Investigator</strong>, 12/08-11/13, &#36;3,514,780.</p>\n\n<p>16. R01 MH083704 “Childhood Maltreatment: Biomarkers of Risk and Resilience,” role: <strong>Principal Investigator</strong>, 12/09-11/14, &#36;2,863,342.</p>\n\n<p>17. R01 NR012005 “RCT of Hatha Yoga for Persistent Depression,” role: <strong>Co-Investigator</strong>, 2/11 - 01/15, &#36;1,718,041.</p>\n\n<p>18. R21 MH091508 “Childhood Maltreatment: Epigenetic Modulation of the Glucocorticoid Receptor,” role: <strong>Principal Investigator</strong>, 4/08/11-3/31/13,    &#36;393,156.</p>\n\n<p>19. R01MH068767 - 08W1 Supplement to “DEX/CRH Response: Mood/Anxiety Disorder Endophenotype? Phase 2.” Telomere Shortening in Relation to Early-Life Stress, role: <strong>Co-Investigator</strong>, 5/8/12-4/30/13, &#36;60,000.</p>\n\n<p>20. R01 MH083704-Supplement to “Childhood Maltreatment: Biomarkers of Risk and Resilience,” role: <strong>Principal Investigator</strong>, 07/29/12-11/30/2014, &#36;185,143.</p>\n\n<p>21. R34 MH099310 “Testosterone Augmentation in Women,” role: <strong>Co-Investigator</strong>, 6/30/13-6/30/15, &#36;633,150.</p>\n\n<p>22. HHSN2712011000061 “Rapidly Acting Treatments for Treatment-Resistant Depression (RAPID),” role: <strong>Co-Investigator</strong>, 4/1/14-3/31/16, &#36;341,269.</p>\n\n<p>23. Brown Institute for Brain Science / Norman Prince Neurosciences Institute New Frontiers Award “Developmental Response to Early Stress: Neural Mechanisms of Cognitive and Behavioral Effects,” role: <strong>Co Principal Investigator</strong>, 1/1/14-12/31/14, &#36;40,000.</p>\n\n<p>24. 1 R01 MH101107 “Early Life Stress: Epigenetic Regulation of Endocrine and Immune Pathways,” role: <strong>Principal Investigator</strong>, 4/1/2014-3/31/2019, &#36;2,639,488.</p>\n\n<p>25. 1 R01 NR014540-01A1 “RCT of a Tailored Walking Program to Reduce Stress Among Pregnant Women,” role: <strong>Co-Investigator</strong>,  9/17/14-9/16/19, 2,358,850.</p>\n\n<p>26.  R01MH105379-01 “Biomarkers, Social, and Affective Predictors of Suicidal Thoughts and Behaviors in Adolescents”, role: <strong>Co-Investigator</strong>, 3/1/15-2/28/19, &#36;3,230,458.</p>\n\n<p>27.  1R25MH101076 “Promoting Research Training During Psychiatry Residency,” role: <strong>Principal Investigator</strong>, 7/1/13-6/30/18, &#36;989,310.</p>\n\n<p>28.  1R25MH101076 S1 Supplement to “Promoting Research Training During Psychiatry Residency” to support the National Neuroscience Curriculum Initiative. role: <strong>Principal Investigator</strong>, 7/1/13-6/30/18, &#36;989,310.</p>\n\n<p>29.  TACO / The White Family Foundation Grant to fund purchase of a spectrophotometer, <strong>Principal Investigator,</strong> 1/1/2016, &#36;5,000.</p>\n\n<p>30.  Brown Institute for Brain Science / Norman Prince Neurosciences Institute New Frontiers Award “Molecular Mechanisms of the Impact of Early Adversity on Neuronal Development: Focus on Mitochondria,” role: <strong>Co Principal Investigator</strong>, 5/1/16-4/30/17, &#36;40,000.</p>\n\n<p>31.  1R01HD086487-01  “Risk Profiles and Mechanisms of Disease in Maltreated Children,” role: <strong>Principal Investigator</strong>, 9/21/16-5/31/21, &#36;2,962,164.</p>\n\n<p>32.  1F31HD088020-01A1 “Biological Indicators of Trauma in Foster Youth: The Role of Social Support,” role: <strong>Co-Mentor</strong>, 4/25/17-4/24/19, &#36;76,488.</p>\n\n<p>33.  Roddy Holden Kinzel Foundation equipment grant “Childhood Adversity and Mitochondrial Function,” <strong>Principal Investigator</strong>, 12/1/17, &#36;10,000.</p>\n\n<p>34.  Brown Institute for Brain Science / Norman Prince Neurosciences Institute New Frontiers Award “Molecular Mechanisms of the Impact of Early Adversity on Neuronal Development: Focus on Mitochondria, Phase II” role: <strong>Co Principal Investigator</strong>, 5/1/17-4/30/18, &#36;40,000.</p>\n\n<p>35. Ida Ballou Littlefield Foundation equipment grant “Early Life Stress and Mitochondrial Function,” <strong>Principal Investigator</strong>, 1/17/18, &#36;7,500.</p>\n\n<p>36. 3R25MH101076-05S2 Supplement to “Promoting Research Training During Psychiatry Residency” to support a summer research fellowship in psychiatry for medical students from under-represented minority groups, role: <strong>Principal Investigator</strong>, 6/21/18-8/03/18, &#36;10,433.</p>\n"}
