{"awards_honors":"<p>PREDOCTORAL HONORS AND AWARDS<br />\n<br />\n1988 B.A., Summa Cum Laude, State University of New York College at Purchase<br />\n<br />\n1988 Award for Outstanding Undergraduate Research, State University of New York<br />\n<br />\n1994 Robert M. Toll Psychiatry Research Prize, University of Pennsylvania<br />\n<br />\n1999 AMA Rock Sleyster Memorial Scholarship<br />\n<br />\n1999 Kenneth E. Appel Psychiatry Award, University of Pennsylvania School of<br />\nMedicine<br />\n<br />\n<br />\nPOSTGRADUATE HONORS AND AWARDS<br />\n<br />\n2002 The American College of Psychiatrists 2002 Laughlin Fellowship Recipient.<br />\n<br />\n2002 First Prize, Resident Research, Sixth Annual Research Symposium, Brown University School of Medicine Department of Psychiatry and Human Behavior<br />\n<br />\n2003 American Psychiatric Association Research Colloquium for Junior Investigators, Participant and Travel Award Recipient<br />\n<br />\n2003 NIMH Mentored Patient-Oriented Research Career Development Award<br />\n<br />\n2003 Janssen Psychiatry Resident Award of Excellence<br />\n<br />\n2003 NARSAD Young Investigator Award<br />\n<br />\n2003 Janssen Pharmaceutica Faculty Development Award in Psychopharmacology<br />\n<br />\n2003 NIH Clinical Research Loan Repayment Program<br />\n<br />\n2004 American College of Neuropsychopharmacology Young Investigator Travel Award<br />\n<br />\n2005 Future Leaders in Psychiatry Symposium Travel Award<br />\n<br />\n2007, 2008, 2009, 2010 Citation, Best Doctors in America (Best Doctors, Inc)<br />\n<br />\n2007 Outstanding Teaching Award in General Psychiatry, Alpert Medical School of Brown University, Department of Psychiatry and Human Behavior<br />\n<br />\n2009 The DBSA 2009 Gerald L. Klerman Young Investigator Award</p>\n\n<p>2014  Brown Institute for Brain Science / Norman Prince Neurosciences Institute New Frontiers Award, Co-Awardees Tyrka and Amso</p>\n\n<p>2016  Brown Institute for Brain Science / Norman Prince Neurosciences Institute New Frontiers Award, Co-Awardees Tyrka and Bath</p>\n\n<p>2016  Psychiatry Research Mentor Award, Warren Alpert Medical School of Brown University, Department of Psychiatry and Human Behavior</p>\n\n<p>2017  Brown Institute for Brain Science / Norman Prince Neurosciences Institute New Frontiers Award, Co-Awardees Tyrka and Bath</p>\n\n<p>2018  Psychiatry Education Award, Warren Alpert Medical School of Brown University, Department of Psychiatry and Human Behavior</p>\n"}
