# All predicate/values for subject
# <http://vivo.brown.edu/individual/cmacdonn>

```
select ?p ?o
where
{
  <http://vivo.brown.edu/individual/cmacdonn> ?p ?o .
}
```

{
  "head": {
    "vars": [ "p" , "o" ]
  } ,
  "results": {
    "bindings": [
      {
        "p": { "type": "uri" , "value": "http://vivoweb.org/ontology/core#overview" } ,
        "o": { "type": "literal" , "value": "Dr. MacDonnell\u2019s teaching and research interests focus on Inter-professional Education practice and pedagogy.. She has helped to establish a collection of cooperative educational curricula, conducted with the University\u2019s College of Nursing and Physical Therapy, Rhode Island College School of Nursing and it\u2019s Graduate School of Social Work and the Warren Alpert School of Medicine at Brown University.\n<p>Dr. MacDonnell\u2019s clinical teaching, practice and research interests are focused on diseases of the eye and skin. She was an invited speaker presenting on \u201COcular Symptoms in Your Pharmacy: the Management of Common Eye Conditions\u201D at the American Pharmacists Association\u2019s 2015 annual meeting held in San Diego California. She also recently authored an \u201Cin-book\u201D continuation education monograph titled: \u201CThe Role of the Specialty Pharmacist in Optimizing the Quality of Care for Patients with Psoriasis and Psoriatic Arthritis.\u201D<\/p>\n\n<p> <\/p>\n" }
      } ,
      {
        "p": { "type": "uri" , "value": "http://vivoweb.org/ontology/core#educationalTraining" } ,
        "o": { "type": "uri" , "value": "http://vivo.brown.edu/individual/degree7fed0fd3d24a0217308be232c5a98f8d249fd985" }
      } ,
      {
        "p": { "type": "uri" , "value": "http://vivoweb.org/ontology/core#educationalTraining" } ,
        "o": { "type": "uri" , "value": "http://vivo.brown.edu/individual/degreebcb535757547bf44740eba737523b2641d70a6fc" }
      } ,
      {
        "p": { "type": "uri" , "value": "http://vivoweb.org/ontology/core#primaryEmail" } ,
        "o": { "type": "literal" , "value": "celia_macdonnell@brown.edu" }
      } ,
      {
        "p": { "type": "uri" , "value": "http://vivo.brown.edu/ontology/vivo-brown/affiliations" } ,
        "o": { "type": "literal" , "value": "<p>STFM<\/p>\n\n<p>APhA<\/p>\n\n<p>ACCP<\/p>\n\n<p>AACP<\/p>\n" }
      } ,
      {
        "p": { "type": "uri" , "value": "http://vivo.brown.edu/ontology/vivo-brown/awardsAndHonors" } ,
        "o": { "type": "literal" , "value": "<p>URI College of Pharmacy Teacher of the Year 2006 and 2007<\/p>\n\n<p>Bowl of Hygeia  2009<\/p>\n\n<p>AACP Excellence in Assessment  2013<\/p>\n\n<p>Rufus Lyman Award Published Research 2013<\/p>\n" }
      } ,
      {
        "p": { "type": "uri" , "value": "http://www.w3.org/1999/02/22-rdf-syntax-ns#type" } ,
        "o": { "type": "uri" , "value": "http://vivoweb.org/ontology/core#FacultyMember" }
      } ,
      {
        "p": { "type": "uri" , "value": "http://www.w3.org/1999/02/22-rdf-syntax-ns#type" } ,
        "o": { "type": "uri" , "value": "http://vivo.brown.edu/ontology/vivo-brown/BrownThing" }
      } ,
      {
        "p": { "type": "uri" , "value": "http://www.w3.org/1999/02/22-rdf-syntax-ns#type" } ,
        "o": { "type": "uri" , "value": "http://www.w3.org/2002/07/owl#Thing" }
      } ,
      {
        "p": { "type": "uri" , "value": "http://www.w3.org/1999/02/22-rdf-syntax-ns#type" } ,
        "o": { "type": "uri" , "value": "http://xmlns.com/foaf/0.1/Person" }
      } ,
      {
        "p": { "type": "uri" , "value": "http://www.w3.org/1999/02/22-rdf-syntax-ns#type" } ,
        "o": { "type": "uri" , "value": "http://xmlns.com/foaf/0.1/Agent" }
      } ,
      {
        "p": { "type": "uri" , "value": "http://vivo.brown.edu/ontology/vivo-brown/fisCreated" } ,
        "o": { "datatype": "http://www.w3.org/2001/XMLSchema#date" , "type": "typed-literal" , "value": "2016-01-29" }
      } ,
      {
        "p": { "type": "uri" , "value": "http://vivo.brown.edu/ontology/vivo-brown/fisCreated" } ,
        "o": { "datatype": "http://www.w3.org/2001/XMLSchema#date" , "type": "typed-literal" , "value": "2015-11-04" }
      } ,
      {
        "p": { "type": "uri" , "value": "http://vivo.brown.edu/ontology/vivo-brown/primaryOrgLabel" } ,
        "o": { "type": "literal" , "value": "Family Medicine" }
      } ,
      {
        "p": { "type": "uri" , "value": "http://vivo.brown.edu/ontology/vivo-brown/pubmedFirstName" } ,
        "o": { "type": "literal" , "value": "Celia" }
      } ,
      {
        "p": { "type": "uri" , "value": "http://vitro.mannlib.cornell.edu/ns/vitro/0.7#mostSpecificType" } ,
        "o": { "type": "uri" , "value": "http://vivoweb.org/ontology/core#FacultyMember" }
      } ,
      {
        "p": { "type": "uri" , "value": "http://vitro.mannlib.cornell.edu/ns/vitro/0.7#mostSpecificType" } ,
        "o": { "type": "uri" , "value": "http://vivo.brown.edu/ontology/vivo-brown/BrownThing" }
      } ,
      {
        "p": { "type": "uri" , "value": "http://vivo.brown.edu/ontology/vivo-brown/hasAffiliation" } ,
        "o": { "type": "uri" , "value": "http://vivo.brown.edu/individual/org-brown-univ-dept230" }
      } ,
      {
        "p": { "type": "uri" , "value": "http://vivo.brown.edu/ontology/vivo-brown/profileUpdated" } ,
        "o": { "datatype": "http://www.w3.org/2001/XMLSchema#dateTime" , "type": "typed-literal" , "value": "2015-11-11T11:39:19.510527" }
      } ,
      {
        "p": { "type": "uri" , "value": "http://vitro.mannlib.cornell.edu/ns/vitro/public#mainImage" } ,
        "o": { "type": "uri" , "value": "http://vivo.brown.edu/individual/n70482" }
      } ,
      {
        "p": { "type": "uri" , "value": "http://vivoweb.org/ontology/core#personInPosition" } ,
        "o": { "type": "uri" , "value": "http://vivo.brown.edu/individual/fis125402" }
      } ,
      {
        "p": { "type": "uri" , "value": "http://vivo.brown.edu/ontology/vivo-brown/pubmedLastName" } ,
        "o": { "type": "literal" , "value": "MacDonnell" }
      } ,
      {
        "p": { "type": "uri" , "value": "http://vivo.brown.edu/ontology/vivo-brown/fisUpdated" } ,
        "o": { "datatype": "http://www.w3.org/2001/XMLSchema#date" , "type": "typed-literal" , "value": "2016-09-07" }
      } ,
      {
        "p": { "type": "uri" , "value": "http://xmlns.com/foaf/0.1/firstName" } ,
        "o": { "type": "literal" , "value": "Celia" }
      } ,
      {
        "p": { "type": "uri" , "value": "http://vivo.brown.edu/ontology/vivo-brown/shortId" } ,
        "o": { "type": "literal" , "value": "cmacdonn" }
      } ,
      {
        "p": { "type": "uri" , "value": "http://xmlns.com/foaf/0.1/lastName" } ,
        "o": { "type": "literal" , "value": "MacDonnell" }
      } ,
      {
        "p": { "type": "uri" , "value": "http://www.w3.org/2000/01/rdf-schema#label" } ,
        "o": { "type": "literal" , "value": "MacDonnell, Celia" }
      } ,
      {
        "p": { "type": "uri" , "value": "http://vivoweb.org/ontology/core#middleName" } ,
        "o": { "type": "literal" , "value": "P" }
      } ,
      {
        "p": { "type": "uri" , "value": "http://vivoweb.org/ontology/core#preferredTitle" } ,
        "o": { "type": "literal" , "value": "Adjunct Associate Professor of Family Medicine" }
      }
    ]
  }
}
